Repository: NugOrNook/projectVongola
Catalog: lib/l10n/app_*.arb
Languages: th

source: transactionType
th: ประเภทธุรกรรม

source: Income
th: รายรับ

source: Expense
th: รายจ่าย

source: Please select a transaction type
th: กรุณาเลือกประเภทธุรกรรม

source: Category
th: ประเภท

source: Please select a category
th: กรุณาเลือกประเภทรายจ่าย

source: Food
th: อาหาร

source: Travel expenses
th: ค่าเดินทาง

source: Water bill
th: ค่าน้ำ

source: Electricity bill
th: ค่าไฟ

source: Internet cost
th: ค่าอินเทอร์เน็ต

source: House cost
th: ค่าบ้าน

source: Car fare
th: ค่ารถ

source: Gasoline cost
th: ค่าน้ำมัน

source: Medical expenses
th: ค่ายา

source: Beauty expenses
th: ค่าเครื่องสำอาง

source: Other
th: อื่นๆ

source: Amount
th: จำนวนเงิน

source: Please enter the amount of money
th: กรุณากรอกจำนวนเงิน

source: Please enter a valid number
th: กรุณาใส่ตัวเลขที่ถูกต้อง

source: Pick Image
th: เลือกภาพ

source: This slip has already been recorded.
th: สลิปนี้เคยถูกบันทึกแล้ว

source: Invalid category selected.
th: การเลือกประเภทไม่ถูกต้อง

source: Save
th: บันทึก

source: home
th: หน้าหลัก

source: dashboard
th: รายงาน

source: wallet
th: กระเป๋า

source: budget
th: งบประมาณ

source: expense & Income Log
th: การบันทึกธุรกรรม

source: select transaction type
th: เลือกประเภท

source: Appointment Date
th: วัน เดือน ปี

source: Select category
th: เลือกประเภท

source: Enter amount
th: กรอกจำนวนเงิน

source: Amount numeric
th: กรุณากรอกจำนวนเงินให้ถูกต้อง

source: memo
th: โน้ต

source: Memo description
th: กรอกข้อมูลบันทึกช่วยจำ

# startAccounting
source: Let's start accounting for expenses
th: มาบันทึกรายจ่ายกันเถอะ

source: Hello, Friend!
th: สวัสดี, เพื่อน!

# showbudget
source: Budget in each category
th: งบประมาณที่ถูกใช้

source: Summary for
th: ยอดรวมของ

source: Spent
th: ใช้ไปแล้ว

source: THB
th: บาท

source: CHART
th: แผนภูมิ

source: RECORD
th: การบันทึก

source: COMPARE
th: เปรียบเทียบ

source: No records for this day
th: ไม่มีการบันทึกในวันนี้

source: Close
th: ปิด

source: Day
th: วัน

source: Month
th: เดือน

source: Year
th: ปี

source: Custom
th: กำหนดเอง

# selectDate
source: Select start date
th: เลือกวันเริ่มต้น

# donutchart
source: Show expense types
th: แสดงประเภทรายจ่าย

# editExpense
source: Edit transaction
th: แก้ไขการบันทึก

# calcel
source: cancel
th: ยกเลิก

source: Select end date
th: เลือกวันสิ้นสุด

# nodata
source: No data found
th: ไม่มีการบันทึกข้อมูล

source: Total income
th: รายรับทั้งหมด

source: Total expense
th: รายจ่ายทั้งหมด

source: Start date
th: วันเริ่มต้น

source: End date
th: วันสิ้นสุด

source: Compare Chart
th: กราฟการเปรียบเทียบ

# showExpensesIncome
source: Show Expense and Income Comparison
th: แสดงการเปรียบเทียบรายรับรายจ่าย

source: Balance
th: ยอดคงเหลือ

source: Add budget category
th: กำหนดงบประมาณแต่ละประเภท

source: Warning
th: แจ้งเตือน

source: The budget for
th: งบประมาณสำหรับ

# isover
source: is over 80%.
th: เกิน 80%

source: The balance is
th: ยอดเงินคงเหลือคือ

source: Add budget
th: กำหนดงบประมาณ

source: Edit Budget
th: แก้ไขงบประมาณ

source: Budget Detail
th: รายละเอียดงบประมาณ

# noBudgetFound
source: No budgets found.
th: ไม่พบการกำหนดงบประมาณ

source: Edit
th: แก้ไข

# high
source: High expenses
th: รายจ่ายสูงเกินไป!

# endDateBeforeStartDate
source: Please select the correct date.
th: กรุณาเลือกวันที่ให้ถูกต้อง
